package zaurTregulov.collections.bigOnatation;

public class Example1Onatation {
    // bigOnatation - нужны для описания сложности алгоритмов.
    // Для этого используется понятие времени. т.е. за какое время выполняются те или иные алгоритмы.
    // Описание сложности алгоритмов через количество операций, необходимых для описания алгоритма.
    //Насколько увеличивается количество операций при увеличении количества элементов в нашей коллекции.
    // "O1" - сложность порядка "1" - в независимости от количество элементов коллекции (например
    //количество элементов массива) метод будет работать такое же время.

    /** "Оn" - сложность порядка n/ Называют такой алгоритм линейно масштабируемым.
     * Чем больше элементов в нашей коллекции тем большее количество шагов надо сделать для получения результата.
     *
     */

}
